; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v1 ?v8)
             (pred_11 ?v9 ?v13)
             (pred_7 ?v1 ?v13)
             (pred_5 ?v3 ?v1 )
	     (pred_3 ?v1)
             (pred_9 ?v12)
             (pred_8 ?v9)
             (pred_6 ?v13)
             (pred_1 ?v1)
             (pred_12 ?v9)
             (pred_10 ?v1)
             (pred_4 ))



(:action op_1
:parameters (?v4 ?v10 ?v6 ?v2)
:precondition (and (pred_9 ?v4) (pred_9 ?v10) (pred_8 ?v6) (pred_6 ?v2)
          (pred_2 ?v4 ?v10) (pred_11 ?v6 ?v2)
                   (pred_7 ?v10 ?v2) (pred_3 ?v4) 
                   (pred_1 ?v10) (pred_12 ?v6))
:effect (and  (pred_10 ?v10) (not (pred_1 ?v10))))


(:action op_3
:parameters (?v4 ?v5)
:precondition (and (pred_9 ?v4) (pred_9 ?v5)
               (pred_3 ?v4) (pred_2 ?v4 ?v5) (pred_10 ?v5))
:effect (and (pred_3 ?v5) (not (pred_3 ?v4))))

(:action op_2
:parameters (?v4 ?v6)
:precondition (and (pred_9 ?v4) (pred_8 ?v6) 
                  (pred_3 ?v4) (pred_5 ?v6 ?v4) (pred_4 ))
:effect (and (pred_12 ?v6)
   (not (pred_5 ?v6 ?v4)) (not (pred_4 ))))


(:action op_4
:parameters (?v4 ?v11 ?v7)
:precondition (and (pred_9 ?v4) (pred_8 ?v11) (pred_8 ?v7)
                  (pred_3 ?v4) (pred_12 ?v7) (pred_5 ?v11 ?v4))
:effect (and (pred_12 ?v11) (pred_5 ?v7 ?v4)
        (not (pred_12 ?v7)) (not (pred_5 ?v11 ?v4))))

(:action op_5
:parameters (?v4 ?v6)
:precondition (and (pred_9 ?v4) (pred_8 ?v6) 
                  (pred_3 ?v4) (pred_12 ?v6))
:effect (and (pred_4 ) (pred_5 ?v6 ?v4) (not (pred_12 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_05 obj_11 obj_19 obj_06 obj_17 obj_07 obj_01 obj_22 obj_14 obj_02 obj_09 obj_21 obj_18 obj_03 obj_15
    obj_10 obj_04 obj_20
    obj_16 obj_13 obj_08
    )

    (:init
       (pred_4)

       (pred_9 obj_12)
       (pred_9 obj_05)
       (pred_9 obj_11)
       (pred_9 obj_19)
       (pred_9 obj_06)
       (pred_9 obj_17)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_22)
       (pred_9 obj_14)
       (pred_9 obj_02)
       (pred_9 obj_09)
       (pred_9 obj_21)
       (pred_9 obj_18)
       (pred_9 obj_03)
       (pred_9 obj_15)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_8 obj_16)
       (pred_8 obj_13)
       (pred_8 obj_08)

       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_05)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_11 obj_19)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_19 obj_11)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_06 obj_17)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_17 obj_14)
       (pred_2 obj_17 obj_07)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_17 obj_06)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_07 obj_17)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_22 obj_21)
       (pred_2 obj_22 obj_14)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_14 obj_18)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_17)
       (pred_2 obj_14 obj_22)
       (pred_2 obj_02 obj_03)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_07)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_09 obj_15)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_21 obj_18)
       (pred_2 obj_21 obj_22)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_18 obj_14)
       (pred_2 obj_18 obj_21)
       (pred_2 obj_03 obj_15)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_15 obj_09)
       (pred_2 obj_15 obj_03)
       (pred_1 obj_15)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_7  obj_15 obj_10)
       (pred_7  obj_07 obj_04)
       (pred_7  obj_02 obj_20)
       (pred_10 obj_12)
       (pred_10 obj_05)
       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_17)
       (pred_10 obj_01)
       (pred_10 obj_22)
       (pred_10 obj_14)
       (pred_10 obj_09)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_03)

       (pred_11  obj_16 obj_10)
       (pred_11  obj_13 obj_04)
       (pred_11  obj_08 obj_20)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_13 obj_18)
       (pred_5 obj_08 obj_06)
       (pred_3 obj_14)
    )

    (:goal (and
       (pred_5 obj_13 obj_12)
       (pred_5 obj_08 obj_19)
    ))
(:constraints
  (always (not (pred_3 obj_17)))
)
)

; plan
1. (op_3 obj_14 obj_18)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_18)
   goals met: 0 of 2
2. (op_2 obj_18 obj_13)
   deleted: (pred_5 obj_13 obj_18) (pred_4)
   added: (pred_12 obj_13)
   goals met: 0 of 2
3. (op_3 obj_18 obj_14)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_14)
   goals met: 0 of 2
4. (op_3 obj_14 obj_22)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_22)
   goals met: 0 of 2
5. (op_3 obj_22 obj_06)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_06)
   goals met: 0 of 2
6. (op_3 obj_06 obj_12)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_12)
   goals met: 0 of 2
7. (op_5 obj_12 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_4) (pred_5 obj_13 obj_12)
   goals met: 1 of 2
8. (op_3 obj_12 obj_06)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_06)
   goals met: 1 of 2
9. (op_2 obj_06 obj_08)
   deleted: (pred_5 obj_08 obj_06) (pred_4)
   added: (pred_12 obj_08)
   goals met: 1 of 2
10. (op_3 obj_06 obj_12)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_12)
   goals met: 1 of 2
11. (op_3 obj_12 obj_05)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_05)
   goals met: 1 of 2
12. (op_3 obj_05 obj_11)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_11)
   goals met: 1 of 2
13. (op_3 obj_11 obj_19)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_19)
   goals met: 1 of 2
14. (op_5 obj_19 obj_08)
   deleted: (pred_12 obj_08)
   added: (pred_4) (pred_5 obj_08 obj_19)
   goals met: 2 of 2
